Autodesk.Navisworks.Api.SearchConditionOptions
Options that modify Autodesk.Navisworks.Api.SearchCondition matching behavior

Autodesk.Navisworks.Api.SearchConditionOptions.None
No additional options

Autodesk.Navisworks.Api.SearchConditionOptions.IgnoreCategoryDisplayName
Do not compare DisplayName when looking for matching category

Autodesk.Navisworks.Api.SearchConditionOptions.IgnoreCategoryName
Do not compare Name when looking for matching category

Autodesk.Navisworks.Api.SearchConditionOptions.IgnorePropertyDisplayName
Do not compare DisplayName when looking for matching property

Autodesk.Navisworks.Api.SearchConditionOptions.IgnorePropertyName
Do not compare Name when looking for matching property

Autodesk.Navisworks.Api.SearchConditionOptions.IgnoreDisplayStringValueCase
Ignore case when comparing DisplayString values

Autodesk.Navisworks.Api.SearchConditionOptions.NegateCondition
Negate the sense of the condition

Autodesk.Navisworks.Api.SearchConditionOptions.StartGroup
When used in a Autodesk.Navisworks.Api.SearchConditionCollection, marks the start of a group of conditions. Collection matches if any group of conditions matches.

Autodesk.Navisworks.Api.SearchConditionOptions.IgnoreDisplayStringValueAccents
Ignore accents when comparing DisplayString values

Autodesk.Navisworks.Api.SearchConditionOptions.IgnoreDisplayStringCharWidths
Ignore character width when comparing DisplayString values

Autodesk.Navisworks.Api.SearchConditionOptions.IgnoreDisplayNames
Do not compare DisplayName when looking for matching category or property

Autodesk.Navisworks.Api.SearchConditionOptions.IgnoreNames
Do not compare Name when looking for matching category or property